/**
 *
 *  getNum
 *
 */

import "./public/getNum";

/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/

/**
 *
 *  sumArr
 *
 */

import "./public/sumArr";

/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/

/**
 *
 * 스크롤 방향 가져오기
 *
 * [script 작성 예]
 * getScrollDirection({
 *    scrollUp() {
 *       // callback
 *    },
 *    scrollDown(_args) {
 *       // callback
 *    },
 *  });
 *
 */

import "./public/getScrollDirection";

/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/

/**
 *
 * window resize event ▼
 *
 * [script 작성 예]
 * onLoadResize({
 *    callback() {
 *       //callback
 *     },
 *   });
 *
 */

import "./public/onLoadResize";

/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/
