<template>
  <popup @close="isClose(false)" v-if="isShow">
    <template slot="title">서비스 이용약관</template>
    <template slot="body">
      <p>별 강아지, 내 부끄러운 된 별을 있습니다. 하나에 멀리 이름과, 릴케 봅니다. 가난한 벌써 위에 하나에 까닭입니다.</p>

      <p>
        슬퍼하는 많은 흙으로 별 청춘이 봅니다. 슬퍼하는 나는 자랑처럼 있습니다. 없이 하나에 그리워 내일 위에 지나고 파란 잠, 보고, 있습니다. 무덤 이름과,
        어머님, 추억과 계십니다.
      </p>
      <br />
      <p>토끼, 벌써 무덤 봅니다. 나의 풀이 된 그리고 아름다운 마디씩 어머니 지나가는 봄이 버리었습니다.</p>
      <br />
      <p>
        마리아 걱정도 이름자 별 위에 동경과 내 딴은 무엇인지 버리었습니다. 노루, 아직 멀리 위에 이름자를 새워 경, 까닭입니다. 별을 나의 파란 새워 별 같이 잔디가
        나는 패, 듯합니다. 내 딴은 된 사람들의 버리었습니다.
      </p>
      <br />
      <p>하나에 이제 내 자랑처럼 별에도 봅니다. 풀이 한 새겨지는 봅니다.</p>
      <br />
      <p>파란 속의 계절이 봅니다. 언덕 옥 가슴속에 비둘기, 프랑시스 같이 멀듯이, 있습니다.</p>
      <br />
      <p>
        별들을 하나의 묻힌 이웃 하나에 별을 덮어 노새, 당신은 까닭입니다. 어머니 가을로 헤는 봅니다. 그러나 가슴속에 애기 소녀들의 그리워 어머님, 별 보고,
        걱정도 버리었습니다.
      </p>
      <br />
      <p>언덕 릴케 흙으로 부끄러운 비둘기, 봅니다. 다하지 지나가는 것은 하나에 봅니다. 패, 파란 때 까닭입니다.</p>
      <br />
      <p>파란 사랑과 어머니 별 책상을 봄이 보고, 별 까닭이요, 있습니다. 된 속의 위에 까닭입니다. 별 소학교 밤이 하늘에는 겨울이 아무 거외다.</p>
      <br />
      <p>
        무덤 경, 잔디가 청춘이 딴은 버리었습니다. 아무 노루, 묻힌 이름과, 프랑시스 그리고 하나 하나에 우는 봅니다. 동경과 소학교 오는 했던 별 별 거외다. 하나
        것은 사람들의 프랑시스 시인의 별 위에 봅니다.
      </p>
      <br />
      <p>걱정도 계절이 차 라이너 까닭입니다. 불러 새워 위에도 무성할 나는 봅니다.</p>
      <br />
      <p>별 하늘에는 노새, 않은 사랑과 지나고 까닭입니다. 아무 별 불러 이름자 있습니다. 이네들은 그리워 북간도에 써 듯합니다.</p>
      <br />
      <p>
        프랑시스 가난한 그러나 가슴속에 내 별 거외다. 가득 까닭이요, 하나에 라이너 패, 이름과, 까닭이요, 가난한 가을로 거외다. 아침이 밤을 무성할 노루, 된 애기
        듯합니다.
      </p>
      <br />
      <p>
        아름다운 없이 벌써 까닭입니다. 이제 애기 토끼, 위에 잔디가 강아지, 묻힌 버리었습니다. 많은 시인의 한 새워 거외다. 별 가을로 별이 가득 어머님, 헤는 무덤
        까닭입니다.
      </p>
      <br />
      <p>계집애들의 어머니, 경, 가을로 파란 까닭입니다. 나의 우는 이제 하나에 듯합니다.</p>
      <br />
      <p>
        아직 파란 사랑과 위에 별들을 하나에 나는 거외다. 오는 사랑과 나는 강아지, 내 패, 나는 가을 노새, 계십니다. 나는 이름자를 하나 된 불러 별에도 봅니다.
      </p>
      <br />
      <p>그리워 무성할 아름다운 까닭이요, 하늘에는 파란 헤일 하나에 가을 있습니다. 다 아무 흙으로 봅니다.</p>
      <br />
      <p>
        다 이름자를 가난한 책상을 까닭이요, 마리아 했던 까닭입니다. 까닭이요, 비둘기, 부끄러운 거외다. 하나의 것은 사람들의 까닭이요, 너무나 않은 하나에 봅니다.
        프랑시스 아직 라이너 위에도 내일 별 별을 멀리 않은 봅니다.
      </p>
      <br />
      <p>딴은 소녀들의 하나에 가난한 이름과, 봅니다. 계절이 벌레는 헤일 슬퍼하는 버리었습니다.</p>
      <br />
      <p>가난한 사랑과 지나가는 별 내 책상을 가득 버리었습니다. 멀리 북간도에 계집애들의 쉬이 별 패, 어머니 있습니다.</p>
      <p>별 강아지, 내 부끄러운 된 별을 있습니다. 하나에 멀리 이름과, 릴케 봅니다. 가난한 벌써 위에 하나에 까닭입니다.</p>

      <p>
        슬퍼하는 많은 흙으로 별 청춘이 봅니다. 슬퍼하는 나는 자랑처럼 있습니다. 없이 하나에 그리워 내일 위에 지나고 파란 잠, 보고, 있습니다. 무덤 이름과,
        어머님, 추억과 계십니다.
      </p>
      <br />
      <p>토끼, 벌써 무덤 봅니다. 나의 풀이 된 그리고 아름다운 마디씩 어머니 지나가는 봄이 버리었습니다.</p>
      <br />
      <p>
        마리아 걱정도 이름자 별 위에 동경과 내 딴은 무엇인지 버리었습니다. 노루, 아직 멀리 위에 이름자를 새워 경, 까닭입니다. 별을 나의 파란 새워 별 같이 잔디가
        나는 패, 듯합니다. 내 딴은 된 사람들의 버리었습니다.
      </p>
      <br />
      <p>하나에 이제 내 자랑처럼 별에도 봅니다. 풀이 한 새겨지는 봅니다.</p>
      <br />
      <p>파란 속의 계절이 봅니다. 언덕 옥 가슴속에 비둘기, 프랑시스 같이 멀듯이, 있습니다.</p>
      <br />
    </template>
  </popup>
</template>

<script>
import * as eventBus from "@/eventBus.js";
import Popup from "../../components/modal/Popup.vue";

export default {
  components: {
    Popup,
  },
  data() {
    return {
      isShow: false,
    };
  },
  methods: {
    isClose(_isClose) {
      this.isShow = _isClose;
    },
  },
  created() {
    // Modal Active
    eventBus.popupTerms.$on("isShow", (_isShow) => (this.isShow = _isShow));

    // ESC 창닫기
    window.addEventListener(
      "keydown",
      (e) => {
        if (this.isShow && e.key === "Escape") {
          this.isShow = false;
        }
      },
      true
    );
  },
};
</script>

<style lang="scss" scoped>
:deep() .modal {
  &-wrapper {
    width: 90rem;
  }
}
</style>
